import React from "react"

const Featured = () => {
    return (
        <div className="featured">
            <div className="container d-flex justify-between">
                <div className="featured__info d-flex">
                    <div className="featured__info_svg">
                        <svg width="50" height="50" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M13.1425 9.24265C13.2859 9.24265 13.4242 9.26571 13.5574 9.30413L16.0419 6.25866C16.2007 6.064 16.4953 6.02814 16.6874 6.19207C16.8744 6.34831 16.9 6.6275 16.7437 6.81704L14.2874 9.82921C14.4539 10.0597 14.5538 10.3441 14.5538 10.6514C14.5538 11.2226 14.2105 11.717 13.7213 11.9372H23.3597C23.7132 11.9372 24.0001 11.6504 24.0001 11.2969V3.19015C24.0001 2.83668 23.7132 2.5498 23.3597 2.5498H11.1164C10.7629 2.5498 10.4761 2.83668 10.4761 3.19015V8.51266L11.0549 9.24522H13.1425V9.24265Z"
                                fill="url(#paint0_linear_101_26)"/>
                            <path
                                d="M5.15601 5.74385C6.60456 5.74385 7.77885 4.56956 7.77885 3.12101C7.77885 1.67245 6.60456 0.498169 5.15601 0.498169C3.70746 0.498169 2.53317 1.67245 2.53317 3.12101C2.53317 4.56956 3.70746 5.74385 5.15601 5.74385Z"
                                fill="url(#paint1_linear_101_26)"/>
                            <path
                                d="M7.84546 22.8615C7.84546 23.215 7.55859 23.5018 7.20512 23.5018H6.12935C5.77588 23.5018 5.48901 23.215 5.48901 22.8615V17.4928C5.48901 17.3033 5.33533 17.1496 5.14578 17.1496C4.95624 17.1496 4.80256 17.3033 4.80256 17.4928V22.8358C4.80256 23.2021 4.50288 23.5018 4.13661 23.5018H3.08388C2.73042 23.5018 2.44354 23.215 2.44354 22.8615L2.43842 9.90095C2.43842 9.72678 2.29755 9.58337 2.12081 9.58337C1.94664 9.58337 1.8032 9.72424 1.8032 9.90095V14.8854C1.8032 15.2388 1.51633 15.5257 1.16286 15.5257H0.640342C0.286873 15.5257 0 15.2388 0 14.8854V8.05165C0 7.23969 0.658271 6.58398 1.46766 6.58398H7.29989C7.92484 6.58398 8.51654 6.87086 8.90587 7.36008L10.4734 9.33745L10.8038 9.75495C10.8038 9.75495 12.2894 9.75496 13.1449 9.75752C13.4984 9.75752 13.7852 10.0444 13.7852 10.3979V10.9076C13.7852 11.261 13.4984 11.5479 13.1449 11.5479H10.3735C10.0995 11.5479 9.84077 11.4224 9.67172 11.2072L8.50374 9.70626C8.44482 9.62942 8.35005 9.58332 8.25272 9.58332H8.17332C7.99915 9.58332 7.85573 9.72419 7.85573 9.9009L7.84546 22.8615Z"
                                fill="url(#paint2_linear_101_26)"/>
                            <defs>
                                <linearGradient id="paint0_linear_101_26" x1="17.2381" y1="2.5498" x2="17.2381"
                                                y2="11.9372" gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#4DB68D"/>
                                    <stop offset="1" stop-color="#8CC3AE"/>
                                </linearGradient>
                                <linearGradient id="paint1_linear_101_26" x1="5.15601" y1="0.498169" x2="5.15601"
                                                y2="5.74385" gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#4DB68D"/>
                                    <stop offset="1" stop-color="#8CC3AE"/>
                                </linearGradient>
                                <linearGradient id="paint2_linear_101_26" x1="6.89262" y1="6.58398" x2="6.89262"
                                                y2="23.5018" gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#4DB68D"/>
                                    <stop offset="1" stop-color="#8CC3AE"/>
                                </linearGradient>
                            </defs>
                        </svg>
                    </div>
                    <div className="featured__info_text">
                        <h4 className="featured__info_title">Спикеры и менторы</h4>
                        <p className="featured__info_desc">профессиональные трейдеры</p>
                    </div>
                </div>
                <div className="featured__info d-flex">
                    <div className="featured__info_svg">
                        <svg width="50" height="50" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M15.6 7.19997C15.6 8.15475 15.2207 9.07043 14.5456 9.74556C13.8704 10.4207 12.9547 10.8 12 10.8C11.0452 10.8 10.1295 10.4207 9.45438 9.74556C8.77925 9.07043 8.39997 8.15475 8.39997 7.19997C8.39997 6.2452 8.77925 5.32952 9.45438 4.65439C10.1295 3.97926 11.0452 3.59998 12 3.59998C12.9547 3.59998 13.8704 3.97926 14.5456 4.65439C15.2207 5.32952 15.6 6.2452 15.6 7.19997V7.19997Z"
                                fill="url(#paint0_linear_101_16)"/>
                            <path
                                d="M21.6001 9.59995C21.6001 10.2365 21.3472 10.8469 20.8971 11.297C20.447 11.7471 19.8366 12 19.2001 12C18.5636 12 17.9531 11.7471 17.503 11.297C17.0529 10.8469 16.8001 10.2365 16.8001 9.59995C16.8001 8.96343 17.0529 8.35298 17.503 7.90289C17.9531 7.45281 18.5636 7.19995 19.2001 7.19995C19.8366 7.19995 20.447 7.45281 20.8971 7.90289C21.3472 8.35298 21.6001 8.96343 21.6001 9.59995V9.59995Z"
                                fill="url(#paint1_linear_101_16)"/>
                            <path
                                d="M16.8 17.9999C16.8 16.7269 16.2943 15.506 15.3941 14.6058C14.4939 13.7057 13.273 13.2 12 13.2C10.7269 13.2 9.50604 13.7057 8.60587 14.6058C7.70569 15.506 7.19998 16.7269 7.19998 17.9999V21.5999H16.8V17.9999Z"
                                fill="url(#paint2_linear_101_16)"/>
                            <path
                                d="M7.19997 9.59995C7.19997 10.2365 6.94711 10.8469 6.49702 11.297C6.04694 11.7471 5.43649 12 4.79997 12C4.16345 12 3.553 11.7471 3.10291 11.297C2.65282 10.8469 2.39997 10.2365 2.39997 9.59995C2.39997 8.96343 2.65282 8.35298 3.10291 7.90289C3.553 7.45281 4.16345 7.19995 4.79997 7.19995C5.43649 7.19995 6.04694 7.45281 6.49702 7.90289C6.94711 8.35298 7.19997 8.96343 7.19997 9.59995V9.59995Z"
                                fill="url(#paint3_linear_101_16)"/>
                            <path
                                d="M19.2001 21.5999V17.9999C19.2018 16.7799 18.892 15.5796 18.3001 14.5127C18.8321 14.3766 19.3882 14.3637 19.9259 14.4752C20.4637 14.5866 20.9688 14.8194 21.4029 15.1558C21.837 15.4922 22.1885 15.9233 22.4306 16.4162C22.6728 16.9091 22.7991 17.4508 22.8001 17.9999V21.5999H19.2001Z"
                                fill="url(#paint4_linear_101_16)"/>
                            <path
                                d="M5.69998 14.5128C5.10808 15.5796 4.7983 16.7799 4.79998 18V21.6H1.19998V18C1.19975 17.4504 1.32534 16.9081 1.56712 16.4146C1.8089 15.9211 2.16045 15.4895 2.59484 15.1529C3.02923 14.8162 3.53492 14.5835 4.07315 14.4726C4.61139 14.3616 5.16788 14.3754 5.69998 14.5128V14.5128Z"
                                fill="url(#paint5_linear_101_16)"/>
                            <defs>
                                <linearGradient id="paint0_linear_101_16" x1="12" y1="3.59998" x2="12" y2="10.8"
                                                gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#EF777B"/>
                                    <stop offset="1" stop-color="#F08F92"/>
                                </linearGradient>
                                <linearGradient id="paint1_linear_101_16" x1="19.2001" y1="7.19995" x2="19.2001" y2="12"
                                                gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#EF777B"/>
                                    <stop offset="1" stop-color="#F08F92"/>
                                </linearGradient>
                                <linearGradient id="paint2_linear_101_16" x1="12" y1="13.2" x2="12" y2="21.5999"
                                                gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#EF777B"/>
                                    <stop offset="1" stop-color="#F08F92"/>
                                </linearGradient>
                                <linearGradient id="paint3_linear_101_16" x1="4.79997" y1="7.19995" x2="4.79997" y2="12"
                                                gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#EF777B"/>
                                    <stop offset="1" stop-color="#F08F92"/>
                                </linearGradient>
                                <linearGradient id="paint4_linear_101_16" x1="20.5501" y1="14.4001" x2="20.5501"
                                                y2="21.5999" gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#EF777B"/>
                                    <stop offset="1" stop-color="#F08F92"/>
                                </linearGradient>
                                <linearGradient id="paint5_linear_101_16" x1="3.44998" y1="14.3984" x2="3.44998"
                                                y2="21.6" gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#EF777B"/>
                                    <stop offset="1" stop-color="#F08F92"/>
                                </linearGradient>
                            </defs>
                        </svg>
                    </div>
                    <div className="featured__info_text">
                        <h4 className="featured__info_title">Вебинар от экспертов</h4>
                        <p className="featured__info_desc">по трендам рынка</p>
                    </div>
                </div>
                <div className="featured__info d-flex">
                    <div className="featured__info_svg">
                        <svg width="50" height="50" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M6.012 18H21V4C21 2.897 20.103 2 19 2H6C4.794 2 3 2.799 3 5V19C3 21.201 4.794 22 6 22H21V20H6.012C5.55 19.988 5 19.806 5 19C5 18.899 5.009 18.809 5.024 18.727C5.136 18.151 5.608 18.01 6.012 18ZM8.648 7.642C9.06423 7.23107 9.62559 7.00065 10.2105 7.00065C10.7954 7.00065 11.3568 7.23107 11.773 7.642L11.997 7.861L12.22 7.642C12.6364 7.231 13.1979 7.00056 13.783 7.00056C14.3681 7.00056 14.9296 7.231 15.346 7.642C15.5526 7.84065 15.7169 8.07895 15.8291 8.34263C15.9414 8.6063 15.9992 8.88993 15.9992 9.1765C15.9992 9.46307 15.9414 9.7467 15.8291 10.0104C15.7169 10.274 15.5526 10.5124 15.346 10.711L11.998 14L8.649 10.711C8.44226 10.5125 8.27775 10.2743 8.16534 10.0106C8.05293 9.74697 7.99494 9.46333 7.99484 9.17671C7.99475 8.8901 8.05256 8.60642 8.16479 8.3427C8.27703 8.07897 8.44139 7.84064 8.648 7.642Z"
                                fill="url(#paint0_linear_101_24)"/>
                            <defs>
                                <linearGradient id="paint0_linear_101_24" x1="12" y1="2" x2="12" y2="22"
                                                gradientUnits="userSpaceOnUse">
                                    <stop stop-color="#B0A04E"/>
                                    <stop offset="1" stop-color="#CCC18A"/>
                                </linearGradient>
                            </defs>
                        </svg>
                    </div>
                    <div className="featured__info_text">
                        <h4 className="featured__info_title">Практика</h4>
                        <p className="featured__info_desc">Создание собственной стратегии торговли.</p>
                    </div>
                </div>
            </div>
        </div>
    )
}

export default Featured